In [1]:
import numpy as np
import pandas as pd

In [2]:
data=pd.read_csv("/home/sajid/Desktop/Quarter_2/Sir Anees git repo/examples/sample.csv")

In [4]:
data

  studentid         name   chimestry   physics   english   math
0       A01     arif ali          20        30        40     50
1       A02  kamran khan          30        40        50     60
2       A03   imran ali           40        50        60     70
3       A04  kashif khan          50        60        70     80

In [5]:
data.index=[chr(i) for i in range(97,101)]

In [6]:
data

  studentid         name   chimestry   physics   english   math
a       A01     arif ali          20        30        40     50
b       A02  kamran khan          30        40        50     60
c       A03   imran ali           40        50        60     70
d       A04  kashif khan          50        60        70     80

In [27]:
data=pd.read_csv("/home/sajid/Desktop/Quarter_2/Sir Anees git repo/examples/sample.csv",
                 skiprows=1,
                 names=["id","name","che","phy","eng","math"])

In [28]:
data

    id         name  che  phy  eng  math
0  A01     arif ali   20   30   40    50
1  A02  kamran khan   30   40   50    60
2  A03   imran ali    40   50   60    70
3  A04  kashif khan   50   60   70    80